public class _01_Process_Thread {
    /*
     *  https://inpa.tistory.com/entry/%F0%9F%91%A9%E2%80%8D%F0%9F%92%BB-%ED%94%84%EB%A1%9C%EC%84%B8%EC%8A%A4-%E2%9A%94%EF%B8%8F-%EC%93%B0%EB%A0%88%EB%93%9C-%EC%B0%A8%EC%9D%B4
     * 
     * 프로그램은 코드 덩어리이다. 파일을 실행하지 않은 상태(메모리에 올라가 있지 않은 상태)는 정적 프로그램이라고 부른다.
     * 프로세스는 프로그램을 실행시킨 동적인 프로그램(메모리에 올라가 있는 상태)을 의미한다.
     * 모든 프로그램은 운영체제가 메모리 공간을 할당해 줘야 실행될 수 있다. 
     * 그래서 프로그램을 실행하는 순간 파일은 컴퓨터 메모리에 올라가게 되고,운영체제로부터 시스템 자원(CPU)을 할당받아
     * 프로그램 코드를 실행시켜 우리가 서비스를 이용할 수 있게 되는 것이다.
     * 
     * 스레드란, 하나의 프로세스 내에서 동시에 진행되는 작업 갈래, 흐름의 단위를 의미한다.
     * 예를 들면, 크롬 브라우저에서 파일을 다운 받고, 쇼핑도 하고, 게임도 한다.
     * 즉, 하나의 프로세스 안에서 여러가지 작업 흐름이 동시에 진행되는데 이런 흐름을 스레드라고 하며,
     * 여러개가 있다면, 이를 멀티(다중) 스레드라고 부른다.
     * 
     * 일반적으로 하나의 프로그램은 하나 이상의 프로세스를 가지고 있고, 하나의 프로세스는 반드시 하나 이상의 스레드를 갖는다.
     * 즉, 프로세스를 생성하면 기본적으로 하나의 main 스레드가 생성되게 된다.
     */ 
    public static void main(String[] args) {
        
    }
}